//
//  Datas.swift
//  PaperWorld
//
//  Created by 闫润邦 on 2023/8/21.
//

import Foundation
import UIKit

class ModelDatas {
    static let names = ["Cinerary urn", "Conall Cael Bell Cover", "\"Rishi\" coffin", "Sleeping Hermaphroditos", "Silent Monitor"]
    static let colors = [UIColor(hex: "#FCB120FF"), UIColor(hex: "#44A0E4FF"), UIColor(hex: "#52BB89FF"), UIColor(hex: "#EC6552FF")]
    static let simpleDescriptions = [
        "Vitalis为妻子做了一座华丽的骨灰盒，两人手牵手地像结婚一样，这对夫妇的\"爱火\"燃烧得真是不一般呀！",
        "这个Conall Cael的铃盖就像个时尚的保护壳，给铃铛一个潮流造型，让它在草原上摇摆时也能保持格调！",
        "“瑞士”棺材 —— 滑稽又“鬼马”的最后一站，逝去不意味着终点，同样能欢乐不停歇！",
        "睡美人——当充满了睡意的两性之神陷入梦乡，世界上可能发生了最奇怪的“人体拼图”游戏！",
        "当你老板突然出现在你身后时，这个“无声监视器”将让你像一只被逮住偷懒的猴子一样尴尬！"
    ]
    static let descriptions = ["""
    博物馆编号：1805,0703.158
    介绍：大理石骨灰瓮由维塔利斯提供，他曾是皇帝的奴隶和寝宫抄写员，他的妻子维尔纳西亚-克拉斯（Vernasia Cyclas）在世 27 年。骨灰瓮的正面是两个高高的火炬，铭文下方是维塔利斯和弗娜西娅，他们的右手紧紧握在一起，就像在婚礼仪式上一样。
    文化/时期：罗马
    生产日期：公元前 1 世纪
    发现地点：发现/获得：罗马（城市），欧洲: 意大利： 拉齐奥： 罗马（省）： 罗马（市）
    材料：大理石
    技艺：雕刻、高浮雕
    尺寸：高度： 49 厘米（柜）（柜），高度： 57 厘米（盖子）（盖子），长度： 81 厘米（胸部）（胸部），长度： 85 厘米（胸 长度： 85 厘米（箱盖）（箱盖），宽度： 42 厘米（胸部）（胸部），宽度： 41 厘米（盖）（盖）
    铭文类型：铭文
    铭文语言：伊特鲁里亚语 伊特鲁里亚语
    铭文翻译： Vel Umrana，Arnth 之子。

    """
                        , """
    博物馆编号：1889,0902.23
    描述：钟形神龛；青铜和银质包金；为圣科纳尔-凯尔的钟而制；饰有银板；正面顶板上有父神坐像，两侧有圣母、圣婴和天使长米迦勒；主面板中央是被钉在十字架上的基督，周围有四个人物，背景是饰有卷轴的面板； 侧面装饰有阶梯状的几何图案；背面和侧面的顶板雕刻有福音书作者的徽章；背面的主面板雕刻有圣人像；用于悬挂的链条；左上方已损坏。
    文化/时期：中世纪晚期
    生产日期：十五世纪
    生产地点：制造地 爱尔兰共和国 欧洲： 不列颠群岛： 爱尔兰： 爱尔兰共和国
    发现点：发现/获得 英尼什凯尔欧洲：不列颠群岛： 爱尔兰： 爱尔兰共和国： 多尼戈（郡）： 英尼什凯尔
    材料：青铜、银、水晶、金
    工艺：雕刻包裹镀金
    尺寸：高度： 219 毫米，重量： 1092.40 克 ，宽度： 155 毫米，深度： 127 毫米
    """
    , """
时期：埃及第二中期时期，公元前 1580-1550 年第 17 王朝
尺寸：高 x 宽 x 长：33.5 x 36 x 158 厘米（13 3/16 x 14 3/16 x 62 3/16 英寸）
莫里斯和路易斯-罗森塔尔基金、霍勒斯和弗洛伦斯-梅耶基金、玛丽莲-M-辛普森基金、威廉-S-史密斯基金、埃及购买基金和弗兰克-B-贝米斯基金 据说来自欧洲私人收藏。1987 年，由纽约 L'Ibis 画廊的 Lucien Viola 出售给艺术博物馆。(入藏日期：1987 年 10 月 28 日）
美术馆 1987.490a-b
材质制作：彩绘梧桐

"""
, """
标题：沉睡的雌雄同体人
时间： 公元 2 世纪中叶
文化： 罗马
材质： 大理石 大理石
尺寸 14 9/16 × 22 1/16 × 59 1/16 英寸，771.6 磅（37 × 56 × 150 厘米，350 千克）
测量包括支架
分类：石雕
沉睡的雌雄同体是一座古老的大理石雕塑，描绘了雌雄同体的真人大小。1620年，意大利艺术家吉安·洛伦佐·贝尼尼（Gian Lorenzo Bernini）雕刻了雕像现在所在的床垫。这种形式部分来自古代对维纳斯和其他女性裸体的描绘，部分来自同时代对狄俄尼索斯/巴克斯的女性化希腊化描绘。它代表了一个在希腊化时代和古罗马经常重复的主题，从幸存下来的版本数量来判断。在罗马圣玛丽亚德拉维多利亚发现的沉睡的雌雄同体立即被红衣主教西皮奥内·博尔盖塞认领，并成为博尔盖塞收藏的一部分。“Borghese Hermaphroditus”后来被卖给了占领的法国人，并被转移到卢浮宫展出。
沉睡的雌雄同体被描述为青铜原件的早期罗马帝国复制品，由两位名为Polycles的希腊化雕塑家（约公元前155年工作）的后期;最初的青铜器在普林尼的《自然史》中被提及。
这座古老的雕塑是在十七世纪的前几十年发现的——出土于圣玛丽亚德拉维多利亚的场地，戴克里先浴场附近，在古老的萨卢斯特花园的范围内。这一发现是在教堂地基被挖掘时（1608年）或种植espalier时发现的。

""",
    """
这个四边形的小木块被称为 "无声监视器"，是罗伯特-欧文（Robert Owen）用来在他的新拉纳克磨坊实施纪律的一种手段。欧文和他的合伙人在 1800 年接管工厂后引入了无声监控器。
罗伯特-欧文强烈反对使用体罚，因此为了维持磨坊的纪律，他设计了一种 "无声监视器"。监视器挂在每个工人旁边，每一面显示不同的颜色。不良 "行为用黑色表示；"无所谓 "用蓝色表示；"好 "用黄色表示；"优秀 "用白色表示。监督员负责每天根据工人的表现转动显示器。然后在 "品德簿 "上记录工人的日常行为，"品德簿 "为工厂的每个部门都配备了。
该 3D 模型由苏格兰海事博物馆制作，是 "扫描地平线 "项目的一部分。

"""]
}
